//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81804HwmSetup.uni>
//
// Description: HWM form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_F81804_HMM_CONFIGURATION                   #language eng "Hardware Monitor"
#string STR_F81804_HMM_CONFIGURATION_HELP              #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                  #language eng "Pc Health Status"
#string STR_F81804_HMM_VIN0                            #language eng "VIN0"
#string STR_F81804_HMM_VIN0_VALUE                      #language eng "N/A"

//Smart Fan setting
#string STR_F81804_SMARTFAN_PROMPT                     #language eng "Smart Fan Function"
#string STR_F81804_SMARTFAN_PROMPT_HELP                #language eng "Enable or Disable Smart Fan"
#string STR_F81804_SMARTFAN_FORM                       #language eng "Smart Fan Mode Configuration"
#string STR_F81804_SMARTFAN_FORM_HELP                  #language eng "Smart Fan Mode Select"
#string STR_F81804_SMARTFAN_CONFIG_HELP                #language eng "Smart Fan  Mode Select"

#string STR_F81804_SMARTFAN_FAN1                       #language eng "Fan 1 Smart Fan Control"
#string STR_F81804_SMARTFAN_FAN_MODE0                  #language eng "Manual RPM Mode"
#string STR_F81804_SMARTFAN_FAN_MODE1                  #language eng "Manual Duty Mode"
#string STR_F81804_SMARTFAN_FAN_MODE2                  #language eng "Auto RPM Mode"
#string STR_F81804_SMARTFAN_FAN_MODE3                  #language eng "Auto Duty-Cycle Mode"
#string STR_F81804_SMARTFAN_TMPSRC                     #language eng "Temperature Source"
#string STR_F81804_SMARTFAN_TMPSRC_HELP                #language eng "Select the monitored temperature source for this fan."
#string STR_F81804_SMARTFAN_TMPSRC_T3                  #language eng "CPU"
#string STR_F81804_SMARTFAN_TMPSRC_T2                  #language eng "System"
#string STR_F81804_SMARTFAN_TMPSRC_T1                  #language eng "CPU(external)"

#string STR_F81804_SMARTFAN_FAN_MODE0_HELP             #language eng "Manual mode fan control, user can write expected RPM count 500-10000"
#string STR_F81804_SMARTFAN_FAN_MODE1_HELP             #language eng "Manual mode fan control, user can write expected duty cycle (PWM fan type) 1-100"
#string STR_F81804_SMARTFAN_FAN_MODE2_HELP             #language eng "Auto fan speed control. Fan speed will follow different temperature by different RPM 1-100"
#string STR_F81804_SMARTFAN_FAN_MODE3_HELP             #language eng "Auto fan speed control. Fan speed will follow different temperature by different duty cycle 1-100"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_T1            #language eng "Temperature 1"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_T2            #language eng "Temperature 2"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_T3            #language eng "Temperature 3"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_T4            #language eng "Temperature 4"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_F1            #language eng "RPM Percentage 1"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_F2            #language eng "RPM Percentage 2"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_F3            #language eng "RPM Percentage 3"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_F4            #language eng "RPM Percentage 4"
#string STR_F81804_SMARTFAN_FAN_AUTO_RPM_F5            #language eng "RPM Percentage 5"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_T1           #language eng "Temperature 1"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_T2           #language eng "Temperature 2"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_T3           #language eng "Temperature 3"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_T4           #language eng "Temperature 4"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_F1           #language eng "Duty Cycle 1"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_F2           #language eng "Duty Cycle 2"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_F3           #language eng "Duty Cycle 3"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_F4           #language eng "Duty Cycle 4"
#string STR_F81804_SMARTFAN_FAN_AUTO_DUTY_F5           #language eng "Duty Cycle 5"
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
